lisp-cheatsheet.org
#+TITLE: Common Lisp Cheatsheet
#+AUTHOR: Philip Dumaresq
#+SETUPFILE: templates/html.org
#+INCLUDE: header.org

This cheatsheet covers most of the stuff needed for COMP-348. Every function referenced in the
lectures and tutorials should appear here. If there's something that I missed, please let me know!

* Functions and variables

| Function    | Example                     | Output     | Description                                         |
|-------------+-----------------------------+------------+-----------------------------------------------------|
| ~defvar~      | ~(defvar x 10)~               | X = 10     | Creates a new global variable                       |
| ~defun~       | ~(defun f (x) ...)~           | F(X) = ... | Creates a new function                              |
| ~set~         | ~(set 'x 20)~                 | X = 20     | Sets the value of a quoted symbol.                  |
| ~setq~        | ~(setq x 30)~                 | X = 30     | Same as ~set~ except you don't need to quote          |
| ~setf~        | ~(setf x 40)~                 | X = 40     | Same as ~setq~ except you can set inside lists        |
| ~let~         | ~(let ((x 1)) x)~             | X = 1      | Creates a locally-scoped variable inside the block  |
| ~let*~        | ~(let ((x 1) (y (+ x 2))) y)~ | 3          | Same as ~let~, but you can use previous bindings      |
| ~defconstant~ | ~(defconstant x 10)~          | X = 10     | Creates a new global constant. Cannot change value. |
| ~boundp~      | ~(boundp 'x)~                 | t          | Returns t if symbol is bound to a value             |

* Functions

| Function | Example              | Output     | Description                                                     |
|----------+----------------------+------------+-----------------------------------------------------------------|
| ~defun~    | ~(defun f (x) ...)~    | F(X) = ... | Creates a new function                                          |
| ~lambda~   | ~(lambda (x) (* x 2))~ | <function> | An instance of a lambda function. Can be assigned to variables. |
| ~funcall~  | ~(funcall #'oddp 1)~   | T          | Calls the given function with it's arguments                    |
| ~apply~    | ~(apply #'oddp '(1))~  | T          | Calls the given function with a list of it's arguments          |

* Lists

| Function  | Example                  | Output     | Description                                                       |
|-----------+--------------------------+------------+-------------------------------------------------------------------|
| ~null~      | ~(null (list 1 2 3))~      | NIL        | Returns t if the list is empty or value is nil.                   |
| ~listp~     | ~(listp (list 1 2 3))~     | T          | Returns t if the element passed in is a list                      |
| ~list~      | ~(list 1 2 3)~             | '(1 2 3)   | Returns a new list of the elements passed to it.                  |
| ~cons~      | ~(cons 1 '(2 3))~          | '(1 2 3)   | Constructs a list given a head and a tail.                        |
| ~car~       | ~(car '(1 2 3))~           | 1          | Returns the head of a list.                                       |
| ~cdr~       | ~(cdr '(1 2 3))~           | '(2 3)     | Returns the tail of a list.                                       |
| ~append~    | ~(append '(1) '(2) '(3))~  | '(1 2 3)   | Appends multiple lists together.                                  |
| ~length~    | ~(length '(1 2 3))~        | 3          | Returns the length of the given list.                             |
| ~member~    | ~(member 2 '(1 2 3))~      | '(2 3)     | Returns the list starting at the first occurence of the element   |
| ~copy-list~ | ~(copy-list '(1 2 3))~     | '(1 2 3)   | Returns a copy of the list, copying each element.                 |
| ~mapcar~    | ~(mapcar #'oddp '(1 2 3))~ | '(T NIL T) | Returns a new list with a given function applied to every element |

