docs/lisp-cheatsheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-21 Wed 11:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Common Lisp Cheatsheet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Philip Dumaresq" />
<link rel="stylesheet" type="text/css" href="https://comp-348.github.io/assets/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">Common Lisp Cheatsheet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga426ea9">Functions and variables</a></li>
<li><a href="#org501915c">Functions</a></li>
<li><a href="#orgf2763e0">Lists</a></li>
<li><a href="#org5d8e894">Conditionals</a></li>
<li><a href="#orgd755a66">Comparisons</a></li>
<li><a href="#org961db42">Numerical functions</a></li>
<li><a href="#org1de0361">Output</a></li>
<li><a href="#org95a3f31">Predicates</a></li>
<li><a href="#orgaf49580">Miscellaneous</a></li>
</ul>
</div>
</div>
<div class="org-center">
<p>
<a href="index.html">Back</a>
</p>
</div>

<p>
This cheatsheet covers most of the stuff needed for COMP-348. Every function referenced in the
lectures and tutorials should appear here. If there's something that I missed, please let me know!
</p>

<div id="outline-container-orga426ea9" class="outline-2">
<h2 id="orga426ea9">Functions and variables</h2>
<div class="outline-text-2" id="text-orga426ea9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Output</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>defvar</code></td>
<td class="org-left"><code>(defvar x 10)</code></td>
<td class="org-left">X = 10</td>
<td class="org-left">Creates a new global variable</td>
</tr>

<tr>
<td class="org-left"><code>defun</code></td>
<td class="org-left"><code>(defun f (x) ...)</code></td>
<td class="org-left">F(X) = &#x2026;</td>
<td class="org-left">Creates a new function</td>
</tr>

<tr>
<td class="org-left"><code>set</code></td>
<td class="org-left"><code>(set 'x 20)</code></td>
<td class="org-left">X = 20</td>
<td class="org-left">Sets the value of a quoted symbol.</td>
</tr>

<tr>
<td class="org-left"><code>setq</code></td>
<td class="org-left"><code>(setq x 30)</code></td>
<td class="org-left">X = 30</td>
<td class="org-left">Same as <code>set</code> except you don't need to quote</td>
</tr>

<tr>
<td class="org-left"><code>setf</code></td>
<td class="org-left"><code>(setf x 40)</code></td>
<td class="org-left">X = 40</td>
<td class="org-left">Same as <code>setq</code> except you can set inside lists</td>
</tr>

<tr>
<td class="org-left"><code>let</code></td>
<td class="org-left"><code>(let ((x 1)) x)</code></td>
<td class="org-left">X = 1</td>
<td class="org-left">Creates a locally-scoped variable inside the block</td>
</tr>

<tr>
<td class="org-left"><code>let*</code></td>
<td class="org-left"><code>(let ((x 1) (y (+ x 2))) y)</code></td>
<td class="org-left">3</td>
<td class="org-left">Same as <code>let</code>, but you can use previous bindings</td>
</tr>

<tr>
<td class="org-left"><code>defconstant</code></td>
<td class="org-left"><code>(defconstant x 10)</code></td>
<td class="org-left">X = 10</td>
<td class="org-left">Creates a new global constant. Cannot change value.</td>
</tr>

<tr>
<td class="org-left"><code>boundp</code></td>
<td class="org-left"><code>(boundp 'x)</code></td>
<td class="org-left">t</td>
<td class="org-left">Returns t if symbol is bound to a value</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org501915c" class="outline-2">
<h2 id="org501915c">Functions</h2>
<div class="outline-text-2" id="text-org501915c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Output</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>defun</code></td>
<td class="org-left"><code>(defun f (x) ...)</code></td>
<td class="org-left">F(X) = &#x2026;</td>
<td class="org-left">Creates a new function</td>
</tr>

<tr>
<td class="org-left"><code>lambda</code></td>
<td class="org-left"><code>(lambda (x) (* x 2))</code></td>
<td class="org-left">&lt;function&gt;</td>
<td class="org-left">An instance of a lambda function. Can be assigned to variables.</td>
</tr>

<tr>
<td class="org-left"><code>funcall</code></td>
<td class="org-left"><code>(funcall #'oddp 1)</code></td>
<td class="org-left">T</td>
<td class="org-left">Calls the given function with it's arguments</td>
</tr>

<tr>
<td class="org-left"><code>apply</code></td>
<td class="org-left"><code>(apply #'oddp '(1))</code></td>
<td class="org-left">T</td>
<td class="org-left">Calls the given function with a list of it's arguments</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf2763e0" class="outline-2">
<h2 id="orgf2763e0">Lists</h2>
<div class="outline-text-2" id="text-orgf2763e0">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Output</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>null</code></td>
<td class="org-left"><code>(null (list 1 2 3))</code></td>
<td class="org-left">NIL</td>
<td class="org-left">Returns t if the list is empty or value is nil.</td>
</tr>

<tr>
<td class="org-left"><code>listp</code></td>
<td class="org-left"><code>(listp (list 1 2 3))</code></td>
<td class="org-left">T</td>
<td class="org-left">Returns t if the element passed in is a list</td>
</tr>

<tr>
<td class="org-left"><code>list</code></td>
<td class="org-left"><code>(list 1 2 3)</code></td>
<td class="org-left">'(1 2 3)</td>
<td class="org-left">Returns a new list of the elements passed to it.</td>
</tr>

<tr>
<td class="org-left"><code>cons</code></td>
<td class="org-left"><code>(cons 1 '(2 3))</code></td>
<td class="org-left">'(1 2 3)</td>
<td class="org-left">Constructs a list given a head and a tail.</td>
</tr>

<tr>
<td class="org-left"><code>car</code></td>
<td class="org-left"><code>(car '(1 2 3))</code></td>
<td class="org-left">1</td>
<td class="org-left">Returns the head of a list.</td>
</tr>

<tr>
<td class="org-left"><code>cdr</code></td>
<td class="org-left"><code>(cdr '(1 2 3))</code></td>
<td class="org-left">'(2 3)</td>
<td class="org-left">Returns the tail of a list.</td>
</tr>

<tr>
<td class="org-left"><code>append</code></td>
<td class="org-left"><code>(append '(1) '(2) '(3))</code></td>
<td class="org-left">'(1 2 3)</td>
<td class="org-left">Appends multiple lists together.</td>
</tr>

<tr>
<td class="org-left"><code>length</code></td>
<td class="org-left"><code>(length '(1 2 3))</code></td>
<td class="org-left">3</td>
<td class="org-left">Returns the length of the given list.</td>
</tr>

<tr>
<td class="org-left"><code>member</code></td>
<td class="org-left"><code>(member 2 '(1 2 3))</code></td>
<td class="org-left">'(2 3)</td>
<td class="org-left">Returns the list starting at the first occurence of the element</td>
</tr>

<tr>
<td class="org-left"><code>copy-list</code></td>
<td class="org-left"><code>(copy-list '(1 2 3))</code></td>
<td class="org-left">'(1 2 3)</td>
<td class="org-left">Returns a copy of the list, copying each element.</td>
</tr>

<tr>
<td class="org-left"><code>mapcar</code></td>
<td class="org-left"><code>(mapcar #'oddp '(1 2 3))</code></td>
<td class="org-left">'(T NIL T)</td>
<td class="org-left">Returns a new list with a given function applied to every element</td>
</tr>
</tbody>
</table>
</div>
</div>
