lisp-cheatsheet.org
* Conditionals

| Function | Example                  | Output | Description                                                          |
|----------+--------------------------+--------+----------------------------------------------------------------------|
| ~if~       | ~(if t 10 20)~             |     10 | If the condition is true, run the first block, otherwise the second. |
| ~and~      | ~(and 10 20)~              |     20 | Return the last value, or nil if they're not all true.               |
| ~or~       | ~(or nil 10)~              |     10 | Return the first non-nil value, or nil if non are true.              |
| ~cond~     | ~(cond (nil 1) (t 2))~     |      2 | Runs the first body who's condition evaluates to true.               |
| ~case~     | ~(case 'a ('a 1) (t 3))~   |      1 | Runs the first body who's condition evaluates to true.               |
| ~when~     | ~(when t (print 1) 2)~     |   1, 2 | Runs the body if the condition evaluates to true.                    |
| ~unless~   | ~(unless nil (print 1) 2)~ |   1, 2 | Runs the body if the condition evaluates to false.                   |
| ~not~      | ~(not nil)~                |      T | Returns T if argument is NIL, returns NIL if argumnent in non-nil. |

* Comparisons

| Function | Example     | Output | Description                                                                  |
|----------+-------------+--------+------------------------------------------------------------------------------|
| ~=~        | ~(= 1 2)~     | nil    | Used for comparing the equality of /numbers/ only.                             |
| ~<~        | ~(< 1 2)~     | t      | Checks if all arguments are smaller than the following arguments             |
| ~>~        | ~(> 1 2)~     | nil    | Checks if all arguments are greater than the following arguments             |
| ~<=~       | ~(<= 1 2)~    | t      | Checks if all arguments are smaller than or equal to the following arguments |
| ~=>~       | ~(=> 1 2)~    | nil    | Checks if all arguments are greater than or equal to the following arguments |
| ~eq~      | ~(eq 1 2)~   | nil    | Checks if two numbers or characters have the same value. |
| ~eql~      | ~(eql 1 2)~   | nil    | Checks if two values refer to the same object or are ~eq~. |
| ~equal~    | ~(equal 1 2)~ | nil    | Checks if two values are equal. Numbers, symbols, strings, lists, etc.       |

* Numerical functions

| Function | Example        | Output | Description                                             |
|----------+----------------+--------+---------------------------------------------------------|
| ~numberp~  | ~(numberp 1)~    |      T | Returns true if it's argument is a number.              |
| ~zerop~    | ~(zerop 0)~      |      T | Returns true if it's argument is zero.                  |
| ~evenp~    | ~(evenp 2)~      |      T | Returns true if it's argument is an even number.        |
| ~oddp~     | ~(oddp 3)~       |      T | Returns true if it's argument is an odd number.         |
| ~plusp~    | ~(plusp -1)~     |    NIL | Returns true if it's argument is a positive number      |
| ~integerp~ | ~(integerp 1.2)~ |    NIL | Returns true if it's argument is an integer             |
| ~+~        | ~(+ 1 2 3 4 5)~  |     15 | Takes the sum of all it's arguments                     |
| ~-~        | ~(- 5 4 3 2 1)~  |     -5 | Subtracts all of it's arguments                         |
| ~*~        | ~(* 1 2 3 4 5)~  |    120 | Takes the product of all it's arguments                 |
| ~/~        | ~(/ 20 2 2)~     |      5 | Divides all of it's arguments                           |
| ~gcd~      | ~(gcd 64 72)~    |      8 | Finds the greatest common denominator of it's arguments |
| ~abs~      | ~(abs -3)~       |      3 | Finds the absolute value of it's argument               |
| ~sin~      | ~(sin 0)~        |      0 | Finds sin(x)                                            |
| ~cos~      | ~(cos 0)~        |      1 | Fins cos(x)                                             |

* Output 

| Function | Example              | Output  | Description                                       |
|----------+----------------------+---------+---------------------------------------------------|
| ~print~    | ~(print "Hello")~      | "Hello" | Prints it's arguments to stdout                   |
| ~format~   | ~(format t "X: ~a" 'Y)~ | "X: Y"  | Print's it's formatted arguments to stdout        |
| ~terpri~   | ~(terpri)~             | "\n"    | Prints a newline. Equivalent to ~(format t "\~%")~. |

