docs/lisp-cheatsheet.html

<div id="outline-container-org5d8e894" class="outline-2">
<h2 id="org5d8e894">Conditionals</h2>
<div class="outline-text-2" id="text-org5d8e894">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-right">Output</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>if</code></td>
<td class="org-left"><code>(if t 10 20)</code></td>
<td class="org-right">10</td>
<td class="org-left">If the condition is true, run the first block, otherwise the second.</td>
</tr>

<tr>
<td class="org-left"><code>and</code></td>
<td class="org-left"><code>(and 10 20)</code></td>
<td class="org-right">20</td>
<td class="org-left">Return the last value, or nil if they're not all true.</td>
</tr>

<tr>
<td class="org-left"><code>or</code></td>
<td class="org-left"><code>(or nil 10)</code></td>
<td class="org-right">10</td>
<td class="org-left">Return the first non-nil value, or nil if non are true.</td>
</tr>

<tr>
<td class="org-left"><code>cond</code></td>
<td class="org-left"><code>(cond (nil 1) (t 2))</code></td>
<td class="org-right">2</td>
<td class="org-left">Runs the first body who's condition evaluates to true.</td>
</tr>

<tr>
<td class="org-left"><code>case</code></td>
<td class="org-left"><code>(case 'a ('a 1) (t 3))</code></td>
<td class="org-right">1</td>
<td class="org-left">Runs the first body who's condition evaluates to true.</td>
</tr>

<tr>
<td class="org-left"><code>when</code></td>
<td class="org-left"><code>(when t (print 1) 2)</code></td>
<td class="org-right">1, 2</td>
<td class="org-left">Runs the body if the condition evaluates to true.</td>
</tr>

<tr>
<td class="org-left"><code>unless</code></td>
<td class="org-left"><code>(unless nil (print 1) 2)</code></td>
<td class="org-right">1, 2</td>
<td class="org-left">Runs the body if the condition evaluates to false.</td>
</tr>

<tr>
<td class="org-left"><code>not</code></td>
<td class="org-left"><code>(not nil)</code></td>
<td class="org-right">T</td>
<td class="org-left">Returns T if argument is NIL, returns NIL if argumnent in non-nil.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd755a66" class="outline-2">
<h2 id="orgd755a66">Comparisons</h2>
<div class="outline-text-2" id="text-orgd755a66">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Output</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>=</code></td>
<td class="org-left"><code>(= 1 2)</code></td>
<td class="org-left">nil</td>
<td class="org-left">Used for comparing the equality of <i>numbers</i> only.</td>
</tr>

<tr>
<td class="org-left"><code>&lt;</code></td>
<td class="org-left"><code>(&lt; 1 2)</code></td>
<td class="org-left">t</td>
<td class="org-left">Checks if all arguments are smaller than the following arguments</td>
</tr>

<tr>
<td class="org-left"><code>&gt;</code></td>
<td class="org-left"><code>(&gt; 1 2)</code></td>
<td class="org-left">nil</td>
<td class="org-left">Checks if all arguments are greater than the following arguments</td>
</tr>

<tr>
<td class="org-left"><code>&lt;=</code></td>
<td class="org-left"><code>(&lt;= 1 2)</code></td>
<td class="org-left">t</td>
<td class="org-left">Checks if all arguments are smaller than or equal to the following arguments</td>
</tr>

<tr>
<td class="org-left"><code>=&gt;</code></td>
<td class="org-left"><code>(=&gt; 1 2)</code></td>
<td class="org-left">nil</td>
<td class="org-left">Checks if all arguments are greater than or equal to the following arguments</td>
</tr>

<tr>
<td class="org-left"><code>eq</code></td>
<td class="org-left"><code>(eq 1 2)</code></td>
<td class="org-left">nil</td>
<td class="org-left">Checks if two numbers or characters have the same value.</td>
</tr>

<tr>
<td class="org-left"><code>eql</code></td>
<td class="org-left"><code>(eql 1 2)</code></td>
<td class="org-left">nil</td>
<td class="org-left">Checks if two values refer to the same object or are <code>eq</code>.</td>
</tr>

<tr>
<td class="org-left"><code>equal</code></td>
<td class="org-left"><code>(equal 1 2)</code></td>
<td class="org-left">nil</td>
<td class="org-left">Checks if two values are equal. Numbers, symbols, strings, lists, etc.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org961db42" class="outline-2">
<h2 id="org961db42">Numerical functions</h2>
<div class="outline-text-2" id="text-org961db42">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-right">Output</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>numberp</code></td>
<td class="org-left"><code>(numberp 1)</code></td>
<td class="org-right">T</td>
<td class="org-left">Returns true if it's argument is a number.</td>
</tr>

<tr>
<td class="org-left"><code>zerop</code></td>
<td class="org-left"><code>(zerop 0)</code></td>
<td class="org-right">T</td>
<td class="org-left">Returns true if it's argument is zero.</td>
</tr>

<tr>
<td class="org-left"><code>evenp</code></td>
<td class="org-left"><code>(evenp 2)</code></td>
<td class="org-right">T</td>
<td class="org-left">Returns true if it's argument is an even number.</td>
</tr>

<tr>
<td class="org-left"><code>oddp</code></td>
<td class="org-left"><code>(oddp 3)</code></td>
<td class="org-right">T</td>
<td class="org-left">Returns true if it's argument is an odd number.</td>
</tr>

<tr>
<td class="org-left"><code>plusp</code></td>
<td class="org-left"><code>(plusp -1)</code></td>
<td class="org-right">NIL</td>
<td class="org-left">Returns true if it's argument is a positive number</td>
</tr>

<tr>
<td class="org-left"><code>integerp</code></td>
<td class="org-left"><code>(integerp 1.2)</code></td>
<td class="org-right">NIL</td>
<td class="org-left">Returns true if it's argument is an integer</td>
</tr>

<tr>
<td class="org-left"><code>+</code></td>
<td class="org-left"><code>(+ 1 2 3 4 5)</code></td>
<td class="org-right">15</td>
<td class="org-left">Takes the sum of all it's arguments</td>
</tr>

<tr>
<td class="org-left"><code>-</code></td>
<td class="org-left"><code>(- 5 4 3 2 1)</code></td>
<td class="org-right">-5</td>
<td class="org-left">Subtracts all of it's arguments</td>
</tr>

<tr>
<td class="org-left"><code>*</code></td>
<td class="org-left"><code>(* 1 2 3 4 5)</code></td>
<td class="org-right">120</td>
<td class="org-left">Takes the product of all it's arguments</td>
</tr>

<tr>
<td class="org-left"><code>/</code></td>
<td class="org-left"><code>(/ 20 2 2)</code></td>
<td class="org-right">5</td>
<td class="org-left">Divides all of it's arguments</td>
</tr>

<tr>
<td class="org-left"><code>gcd</code></td>
<td class="org-left"><code>(gcd 64 72)</code></td>
<td class="org-right">8</td>
<td class="org-left">Finds the greatest common denominator of it's arguments</td>
</tr>

<tr>
<td class="org-left"><code>abs</code></td>
<td class="org-left"><code>(abs -3)</code></td>
<td class="org-right">3</td>
<td class="org-left">Finds the absolute value of it's argument</td>
</tr>

<tr>
<td class="org-left"><code>sin</code></td>
<td class="org-left"><code>(sin 0)</code></td>
<td class="org-right">0</td>
<td class="org-left">Finds sin(x)</td>
</tr>

<tr>
<td class="org-left"><code>cos</code></td>
<td class="org-left"><code>(cos 0)</code></td>
<td class="org-right">1</td>
<td class="org-left">Fins cos(x)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org1de0361" class="outline-2">
<h2 id="org1de0361">Output</h2>
<div class="outline-text-2" id="text-org1de0361">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Output</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>print</code></td>
<td class="org-left"><code>(print "Hello")</code></td>
<td class="org-left">"Hello"</td>
<td class="org-left">Prints it's arguments to stdout</td>
</tr>

<tr>
<td class="org-left"><code>format</code></td>
<td class="org-left"><code>(format t "X: ~a" 'Y)</code></td>
<td class="org-left">"X: Y"</td>
<td class="org-left">Print's it's formatted arguments to stdout</td>
</tr>

<tr>
<td class="org-left"><code>terpri</code></td>
<td class="org-left"><code>(terpri)</code></td>
<td class="org-left">"\n"</td>
<td class="org-left">Prints a newline. Equivalent to <code>(format t "\~%")</code>.</td>
</tr>
</tbody>
</table>
</div>
</div>
