lisp-cheatsheet.org
* Predicates 

| Function | Example             | Output | Description                                        |
|----------+---------------------+--------+----------------------------------------------------|
| ~boundp~   | ~(boundp 'x)~         | T      | Returns true if symbol is bound to a value         |
| ~null~     | ~(null (list 1 2 3))~ | NIL    | Returns true if the list is empty or value is nil. |
| ~atom~     | ~(atom "hello")~      | T      | Returns true if it's argument is an atom or nil    |
| ~listp~    | ~(listp '(1 2))~      | T      | Returns true if it's argument is a list or nil.    |
| ~numberp~  | ~(numberp 1)~         | T      | Returns true if it's argument is a number.         |
| ~evenp~    | ~(evenp 2)~           | T      | Returns true if it's argument is an even number.   |
| ~oddp~     | ~(oddp 3)~            | T      | Returns true if it's argument is an odd number.    |
| ~zerop~    | ~(zerop 0)~           | T      | Returns true if it's argument is zero.             |
| ~plusp~    | ~(plusp -1)~          | NIL    | Returns true if it's argument is a positive number |
| ~integerp~ | ~(integerp 1.2)~      | NIL    | Returns true if it's argument is an integer        |
| ~stringp~  | ~(stringp "a")~       | T      | Returns true if it's argument is a string.         |
| ~symbolp~  | ~(symbolp 'a)~        | T      | Returns true if it's argument is a symbol.         |
| ~keywordp~ | ~(keywordp :a)~       | T      | Returns true if it's argument is a keyword.        |

* Miscellaneous

| Function | Example             | Output | Description                                                         |
|----------+---------------------+--------+---------------------------------------------------------------------|
| ~quote~    | ~(quote a)~           | A      | Returns it's arguments literally, as passed in.                     |
| ~'~        | ~'a~                  | A      | Same as ~quote~, but a nice shorthand.                                |
| ~progn~    | ~(progn (print 1) 2)~ | 1, 2   | Evaluates every expression in it's body and returns the last value. |



