docs/lisp-cheatsheet.html

<div id="outline-container-org95a3f31" class="outline-2">
<h2 id="org95a3f31">Predicates</h2>
<div class="outline-text-2" id="text-org95a3f31">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Output</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>boundp</code></td>
<td class="org-left"><code>(boundp 'x)</code></td>
<td class="org-left">T</td>
<td class="org-left">Returns true if symbol is bound to a value</td>
</tr>

<tr>
<td class="org-left"><code>null</code></td>
<td class="org-left"><code>(null (list 1 2 3))</code></td>
<td class="org-left">NIL</td>
<td class="org-left">Returns true if the list is empty or value is nil.</td>
</tr>

<tr>
<td class="org-left"><code>atom</code></td>
<td class="org-left"><code>(atom "hello")</code></td>
<td class="org-left">T</td>
<td class="org-left">Returns true if it's argument is an atom or nil</td>
</tr>

<tr>
<td class="org-left"><code>listp</code></td>
<td class="org-left"><code>(listp '(1 2))</code></td>
<td class="org-left">T</td>
<td class="org-left">Returns true if it's argument is a list or nil.</td>
</tr>

<tr>
<td class="org-left"><code>numberp</code></td>
<td class="org-left"><code>(numberp 1)</code></td>
<td class="org-left">T</td>
<td class="org-left">Returns true if it's argument is a number.</td>
</tr>

<tr>
<td class="org-left"><code>evenp</code></td>
<td class="org-left"><code>(evenp 2)</code></td>
<td class="org-left">T</td>
<td class="org-left">Returns true if it's argument is an even number.</td>
</tr>

<tr>
<td class="org-left"><code>oddp</code></td>
<td class="org-left"><code>(oddp 3)</code></td>
<td class="org-left">T</td>
<td class="org-left">Returns true if it's argument is an odd number.</td>
</tr>

<tr>
<td class="org-left"><code>zerop</code></td>
<td class="org-left"><code>(zerop 0)</code></td>
<td class="org-left">T</td>
<td class="org-left">Returns true if it's argument is zero.</td>
</tr>

<tr>
<td class="org-left"><code>plusp</code></td>
<td class="org-left"><code>(plusp -1)</code></td>
<td class="org-left">NIL</td>
<td class="org-left">Returns true if it's argument is a positive number</td>
</tr>

<tr>
<td class="org-left"><code>integerp</code></td>
<td class="org-left"><code>(integerp 1.2)</code></td>
<td class="org-left">NIL</td>
<td class="org-left">Returns true if it's argument is an integer</td>
</tr>

<tr>
<td class="org-left"><code>stringp</code></td>
<td class="org-left"><code>(stringp "a")</code></td>
<td class="org-left">T</td>
<td class="org-left">Returns true if it's argument is a string.</td>
</tr>

<tr>
<td class="org-left"><code>symbolp</code></td>
<td class="org-left"><code>(symbolp 'a)</code></td>
<td class="org-left">T</td>
<td class="org-left">Returns true if it's argument is a symbol.</td>
</tr>

<tr>
<td class="org-left"><code>keywordp</code></td>
<td class="org-left"><code>(keywordp :a)</code></td>
<td class="org-left">T</td>
<td class="org-left">Returns true if it's argument is a keyword.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgaf49580" class="outline-2">
<h2 id="orgaf49580">Miscellaneous</h2>
<div class="outline-text-2" id="text-orgaf49580">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Output</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>quote</code></td>
<td class="org-left"><code>(quote a)</code></td>
<td class="org-left">A</td>
<td class="org-left">Returns it's arguments literally, as passed in.</td>
</tr>

<tr>
<td class="org-left"><code>'</code></td>
<td class="org-left"><code>'a</code></td>
<td class="org-left">A</td>
<td class="org-left">Same as <code>quote</code>, but a nice shorthand.</td>
</tr>

<tr>
<td class="org-left"><code>progn</code></td>
<td class="org-left"><code>(progn (print 1) 2)</code></td>
<td class="org-left">1, 2</td>
<td class="org-left">Evaluates every expression in it's body and returns the last value.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Philip Dumaresq</p>
<p class="date">Created: 2020-10-21 Wed 11:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
